//Задача 1. Получить квадрат

Console.Write("Введите число для вычесления квадрата: ");
int x = Convert.ToInt32(Console.ReadLine());
int kvadrat = x * x;

//Console.WriteLine("Квадрат:" + x + " будет:" + kvadrat);

Console.WriteLine($"Квадрат: {x} будет {kvadrat}");



